<template>
  <div class="Problem">
		<Top>常见问题</Top>
		<ul>
			<li v-for="(problem,index) in problems" :key="index" @click="showText(index)">
				<p><span></span>{{ problem.title}}</p><i></i>
				<div v-html="problem.problem" v-show="problem.isShow"></div>
			</li>
		</ul>
  </div>
</template>

<script>
	import Top from './Top'
	
	const problems = [
		{
			isShow: false,
			title: "1、贷款后为什么没人联系我,怎么查进度?",
			problem: "答:贷款申请后一般都会在工作日电话联系,最晚不会超过3天,3天后如依然没电话联系,可能是根据您的资质没有匹配到合适的贷款机构。"
		},
		{
			isShow: false,
			title: "2、贷款所需费用是多少?",
			problem: "答:贷款费用1年期为:8.576%~27.40%,根据您所在城市、年龄、信用记录等综合评级,评级越高可以获得的费用更低。"
		},
		{
			isShow: false,
			title: "3、一般贷款额度是多少?",
			problem: "答:贷款的额度是从500元起至50万,大可根据您之前的计划和还款能力,灵活选择贷款金额。贷款结清后,您还能选择继续申请贷款。"
		},
		{
			isShow: false,
			title: "4、贷款是否要收取我的其他的费用?",
			problem: "答:贷款除按月收取固定月供之外,工作人员不会再收取您任何其他的费用。"
		},
		{
			isShow: false,
			title: "5、信息已经提交,需要多久可以放款?",
			problem: "答:我们不直接放款,会根据您所填写的个人信息匹配合适的贷款产品,匹配成功后,负责该产品的信贷经理会和您联系,请保持您的手机畅通。"
		},
		{
			isShow: false,
			title: "6、快速办高额信用卡攻略",
			problem: "智能手机与信用卡都已经成为许多人的必备工具,吃饭、购物、娱乐都是必不可少的,那么如何用手机申请信用卡昵?怎样才能在最短时间内成功的申请高额信用卡呢?<div>一、证件齐全且有分量</div><div>对于老手来说,如果你要申请一张信用卡,提供齐全的证明会为你申请信用卡增色不少,也更加容易。如果您已经拥有了一张或更多的信用卡,并且还款记录良好,那么一般不需要再提供收入或资产证明了,只需在申请时将已经拥有的信用卡复印,随申请表寄出即可(即使您拥有的信用卡不是申请银行的卡也可以,这是比较容易的一个流程。你只要注意个良好的消费信用和还款信用是你申请高额信用卡的关键。对于白户来讲,你就是一张白纸,想要申请高额信用卡可能有些困难。那么银行看什么呢?您的各种收入资产状况决定是否给您批卡以及信用额度的大小。这个很简单,你可以提供一份有分量的资产证明,如收入证明、房屋产权证明、按揭购房证明、汽车产权证明、银行存款证明或有价证券凭证等。其次,你的工作单位,个人能力,应聘经历等其他些能证明您个人能力的证书也会帮助您获得高额度的信用卡,如学历证书、技术等级证书以及其他资格证书。</div><div>二、申请表格填写加分项</div><div>填写申请表格对于高额信用卡申请还是有益处的。以下几个方面会影响银行对您的信用评估得分,想要信用卡审批的几率高,额度高,那么一定从以下几个方面入手。</div><div>1.固定电话高过无固定电话已婚得分高过未婚</div><div>2.本市户口胜过外地户口</div><div>3.有房一族高过无房一族</div><div>4.学历越高,银行信任度更大</div><div>5.机关事业单位、国企、世界500强高过普通私企</div><div>6.职务情况(职务越高,得分越高。如公务员、公司管理人员得分要比普通职员要高)。对于白户来说,首次申请信用卡的州唉一定要填写清楚上面的加分项,这样能够增加银行对你的信任度,而你申请到高额信用卡的可能性也更大些。</div><div>三、提高使用频率记住,银行不会为一个开卡后从来不用卡或是非常非常偶尔才用卡的人提高额度。如果你属于这一类,请问你要信用卡来干嘛?申请提额又是肿么个意思?如果你很希望信用卡额度能高一点,那么请你频繁使用,不管大额、小额,都养成刷卡习惯。</div><div>四、临时额度提高很方便信用额度并不是越高越好,要与个人经济能力相匹配。如果临时有大额需求,比如购买家电、出国旅行、装修等等,提不了固定额度就提高临时额度呗。别死心眼只想着提高固定额度,没准额度高了,反而带坏你的消费习惯,大手大脚花钱</div>"
		}
	];
	
export default {
  name: '',
  data () {
    return {
      problems : problems
    }
  },
  components: {
	  Top
  },
	methods: {
		showText(index) {
			problems.forEach(function(problem){
				if(problem.isShow !== problems[index].isShow){
					problem.isShow = false;
				}
			});
			problems[index].isShow = !problems[index].isShow;
		}
	}
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
	@import '../../static/css/problem.css';
</style>
